In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [5]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2['a']

-5

In [7]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [10]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [11]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
'b' in obj2

True

In [13]:
'e' in obj2

False

In [14]:
sdata= {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah' : 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [16]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [20]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [21]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [22]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2001],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [23]:
frame = DataFrame(data)

In [24]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2001

In [25]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2001  Nevada  2.9

In [26]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                  index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2001  Nevada  2.9  NaN

In [27]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [28]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [29]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2001
Name: year, dtype: int64

In [30]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [31]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2001  Nevada  2.9  16.5

In [32]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2001  Nevada  2.9     4

In [33]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2001  Nevada  2.9  -1.7

In [34]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2001  Nevada  2.9  -1.7   False

In [35]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [36]:
pop = {'Nevada': {2001:2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [37]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [38]:
DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [39]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [40]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [41]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [42]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2001, 'Nevada', 2.9, -1.7]], dtype=object)

In [43]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [44]:
index[1:]

Index(['b', 'c'], dtype='object')

In [45]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [46]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [47]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [48]:
'Ohio' in frame3.columns

True

In [49]:
2003 in frame3.index

False

In [50]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [52]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [53]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [54]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [55]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                 columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [56]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [57]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [58]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
             columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [59]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

In [60]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [61]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: float64

In [62]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one','two','three','four'])
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [64]:
data.drop(['two','four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [65]:
obj = Series(np.arange(4.), index=['a','b','c','d'])
obj['b']

1.0

In [66]:
obj[1]

1.0

In [67]:
obj[2:4]

c    2
d    3
dtype: float64

In [68]:
obj[['a','b','d']]

a    0
b    1
d    3
dtype: float64

In [69]:
obj[[1,3]]

b    1
d    3
dtype: float64

In [70]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [71]:
obj['b':'c']

b    1
c    2
dtype: float64

In [72]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: float64

In [73]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio','Colorado','Utah', 'New York'],
                columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [75]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [76]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [77]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [79]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [80]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [81]:
data.ix[['Colorado','Utah'], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [82]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [83]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [84]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [85]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [86]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
                index=['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
               index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [87]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [88]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [89]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [90]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [91]:
df1 + df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [92]:
df1.add(df2, fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [93]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [94]:
arr = np.arange(12.).reshape((3,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [95]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [96]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [97]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [98]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [99]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [100]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [101]:
series3 = frame['d']
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [102]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [103]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [104]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.309291 -0.206610  1.007610
Ohio   -0.038221 -0.849100  2.364905
Texas   0.267609  1.111398  1.252353
Oregon -1.194840  0.123628  1.725786

In [105]:
np.abs(frame)

               b         d         e
Utah    1.309291  0.206610  1.007610
Ohio    0.038221  0.849100  2.364905
Texas   0.267609  1.111398  1.252353
Oregon  1.194840  0.123628  1.725786

In [106]:
f = lambda x:x.max() - x.min()
frame.apply(f)

b    1.576900
d    1.960498
e    1.357294
dtype: float64

In [107]:
frame.apply(f, axis=1)

Utah      2.316902
Ohio      3.214005
Texas     0.984744
Oregon    2.920625
dtype: float64

In [108]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -1.309291 -0.849100  1.007610
max  0.267609  1.111398  2.364905

In [109]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d     e
Utah    -1.31  -0.21  1.01
Ohio    -0.04  -0.85  2.36
Texas    0.27   1.11  1.25
Oregon  -1.19   0.12  1.73

In [110]:
frame['e'].map(format)

Utah      1.01
Ohio      2.36
Texas     1.25
Oregon    1.73
Name: e, dtype: object

In [111]:
frame['e'].map(format)

Utah      1.01
Ohio      2.36
Texas     1.25
Oregon    1.73
Name: e, dtype: object

In [112]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [113]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'],
                 columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [114]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [115]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [116]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [117]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [118]:
frame = DataFrame({'b':[4, 7, -3, 2], 'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [119]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [120]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [121]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [122]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [123]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [124]:
frame = DataFrame({'b':[4.3, 7, -3, 2],'a':[0, 1, 0, 1],
                  'c': [-2, 5, 8, -2.5]})

In [125]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [126]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

In [127]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [128]:
obj.index.is_unique

False

In [129]:
obj['a']

a    0
a    1
dtype: int32

In [130]:
obj['c']

4

In [131]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.927443  2.007160 -0.178117
a  0.258757  0.298643 -0.413801
b  0.479547  1.371998  0.948999
b  2.453098  0.010982 -0.076200

In [132]:
df.ix['b']

          0         1         2
b  0.479547  1.371998  0.948999
b  2.453098  0.010982 -0.076200

In [133]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
               [np.nan, np.nan], [0.75, -1.3]],
              index=['a','b','c','d'],
              columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [134]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [135]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [136]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [137]:
df.idxmax()

one    b
two    d
dtype: object

In [138]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [139]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [140]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [141]:
import pandas.io.data as web
#from pandas_datareader import data, wb
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2015', '1/1/2016')
    
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                   for tic, data in all_data.items()})
returns = price.pct_change()
returns.tail()

c:\users\administrator\appdata\local\programs\python\python35\lib\site-packages\pandas\io\data.py:33: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

                AAPL      GOOG       IBM      MSFT
Date
2015-12-24 -0.005340 -0.002546 -0.002093 -0.002687
2015-12-28 -0.011201  0.018854 -0.004629  0.005030
2015-12-29  0.017974  0.018478  0.015769  0.010724
2015-12-30 -0.013059 -0.007211 -0.003148 -0.004244
2015-12-31 -0.019195 -0.015720 -0.012344 -0.014740

In [142]:
returns.MSFT.corr(returns.IBM)

0.54925490713997716

In [143]:
returns.MSFT.cov(returns.IBM)

0.00013047520918292753

In [144]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.379946  0.516671  0.523573
GOOG  0.379946  1.000000  0.451687  0.520563
IBM   0.516671  0.451687  1.000000  0.549255
MSFT  0.523573  0.520563  0.549255  1.000000

In [145]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000284  0.000119  0.000116  0.000157
GOOG  0.000119  0.000347  0.000112  0.000173
IBM   0.000116  0.000112  0.000178  0.000130
MSFT  0.000157  0.000173  0.000130  0.000317

In [146]:
returns.corrwith(returns.IBM)

AAPL    0.516671
GOOG    0.451687
IBM     1.000000
MSFT    0.549255
dtype: float64

In [147]:
returns.corrwith(volume)

AAPL   -0.119118
GOOG    0.405238
IBM    -0.297806
MSFT   -0.003725
dtype: float64

In [148]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()

In [149]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [150]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [151]:
pd.value_counts(obj.values, sort=False)

a    3
b    2
d    1
c    3
dtype: int64

In [152]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [153]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [154]:
data = DataFrame({'Qu1':[1, 3, 4, 3, 4],
                 'Qu2': [2, 3, 1, 2, 3],
                 'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [155]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

In [156]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [157]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [158]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [159]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [160]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [161]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [162]:
cleaned

   0    1  2
0  1  6.5  3

In [163]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [164]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [165]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [166]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.660638       NaN       NaN
1 -0.775130       NaN       NaN
2 -1.335474       NaN       NaN
3 -0.989731       NaN  0.003698
4  0.397479       NaN -0.367233
5  1.495439 -0.485142 -1.289311
6  1.239572  0.486540 -0.968739

In [167]:
df.dropna(thresh=3)

          0         1         2
5  1.495439 -0.485142 -1.289311
6  1.239572  0.486540 -0.968739

In [168]:
df.fillna(0)

          0         1         2
0 -0.660638  0.000000  0.000000
1 -0.775130  0.000000  0.000000
2 -1.335474  0.000000  0.000000
3 -0.989731  0.000000  0.003698
4  0.397479  0.000000 -0.367233
5  1.495439 -0.485142 -1.289311
6  1.239572  0.486540 -0.968739

In [169]:
df.fillna({1:0.5, 3:-1})

          0         1         2
0 -0.660638  0.500000       NaN
1 -0.775130  0.500000       NaN
2 -1.335474  0.500000       NaN
3 -0.989731  0.500000  0.003698
4  0.397479  0.500000 -0.367233
5  1.495439 -0.485142 -1.289311
6  1.239572  0.486540 -0.968739

In [170]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.660638  0.000000  0.000000
1 -0.775130  0.000000  0.000000
2 -1.335474  0.000000  0.000000
3 -0.989731  0.000000  0.003698
4  0.397479  0.000000 -0.367233
5  1.495439 -0.485142 -1.289311
6  1.239572  0.486540 -0.968739

In [171]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:,1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0  0.261330  0.769474 -0.856320
1  0.539240  0.375858  0.860710
2 -1.343993       NaN  0.503499
3 -0.843375       NaN -1.528249
4  0.050664       NaN       NaN
5  0.634622       NaN       NaN

In [172]:
df.fillna(method='ffill')

          0         1         2
0  0.261330  0.769474 -0.856320
1  0.539240  0.375858  0.860710
2 -1.343993  0.375858  0.503499
3 -0.843375  0.375858 -1.528249
4  0.050664  0.375858 -1.528249
5  0.634622  0.375858 -1.528249

In [173]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.261330  0.769474 -0.856320
1  0.539240  0.375858  0.860710
2 -1.343993  0.375858  0.503499
3 -0.843375  0.375858 -1.528249
4  0.050664       NaN -1.528249
5  0.634622       NaN -1.528249

In [174]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [175]:
data = Series(np.random.randn(10),
             index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                   [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    2.319927
   2    0.185136
   3    0.351850
b  1    0.142071
   2   -0.589695
   3    0.894306
c  1   -0.553892
   2   -0.724743
d  2    0.554115
   3   -1.452214
dtype: float64

In [176]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [177]:
data['b']

1    0.142071
2   -0.589695
3    0.894306
dtype: float64

In [178]:
data['b':'c']

b  1    0.142071
   2   -0.589695
   3    0.894306
c  1   -0.553892
   2   -0.724743
dtype: float64

In [179]:
data.ix[['b', 'd']]

b  1    0.142071
   2   -0.589695
   3    0.894306
d  2    0.554115
   3   -1.452214
dtype: float64

In [180]:
data[:,2]

a    0.185136
b   -0.589695
c   -0.724743
d    0.554115
dtype: float64

In [181]:
data.unstack()

          1         2         3
a  2.319927  0.185136  0.351850
b  0.142071 -0.589695  0.894306
c -0.553892 -0.724743       NaN
d       NaN  0.554115 -1.452214

In [182]:
data.unstack().stack()

a  1    2.319927
   2    0.185136
   3    0.351850
b  1    0.142071
   2   -0.589695
   3    0.894306
c  1   -0.553892
   2   -0.724743
d  2    0.554115
   3   -1.452214
dtype: float64

In [183]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                 index=[['a', 'a', 'b', 'b'],[1,2,1, 2]],
                 columns=[['Ohio', 'Ohio', 'Colorado'],
                         ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [184]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [185]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [186]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [187]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [188]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [189]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [190]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [191]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                  'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                  'd':[0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [192]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [193]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [194]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [195]:
ser = Series(np.arange(3.))
ser[1]

1.0

In [196]:
ser

0    0
1    1
2    2
dtype: float64

In [197]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [198]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [199]:
#from ipykernel import kernelapp as app
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [200]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

In [201]:
import pandas.io.data as web
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012')) 
                      for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL'] ))
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [202]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  12.006086  10.39902  160.499779  16.833241
2009-01-05  12.512789  10.26359  163.861421  16.990562
2009-01-06  12.306404  10.68922  166.863420  17.189282
2009-01-07  12.040484  10.78596  160.844427  16.154282
2009-01-08  12.264068  10.90204  162.432840  16.659362
2009-01-09  11.983595  10.75694  157.377899  16.162562
2009-01-12  11.729582  10.30228  156.189080  16.121161
2009-01-13  11.603899  10.40869  157.003261  16.410961
2009-01-14  11.289028   9.97338  150.334921  15.806521
2009-01-15  11.031046  10.19587  149.345914  15.930721
2009-01-16  10.892133   9.93469  149.685575  16.319881
2009-01-20  10.345740   9.52840  141.234014  15.301441
2009-01-21  10.958282   9.86697  151.388865  16.046641
2009-01-22  11.689893   9.65416  153.097158  14.167082
2009-01-23  11.689893   9.80893  162.188089  14.241602
2009-01-26  11.859235   9.97338  161.773501  14.597641
2009-01-27  12.003440   9.74122  165.574702  14.622481
2009-01-28  12.462516  10.52477  174.161139  14.937122
2009-01-29  12.303758   9.62514  171.488809  14.564521
2009-01-30  11.924061   9.18983  169.096191  14.158801
2009-02-02  12.106633   9.00603  170.115172  14.763241
2009-02-03  12.301112   9.45101  170.055239  15.318001
2009-02-04  12.376522   9.47036  171.328962  15.425641
2009-02-05  12.761510   9.12212  176.683613  15.765122
2009-02-06  13.192803   9.15114  185.454867  16.278481
2009-02-09  13.561917   9.32526  189.196135  16.096322
2009-02-10  12.942760   8.86093  179.076231  15.566401
2009-02-11  12.809138   8.72550  178.841472  15.905881
2009-02-12  13.133269   8.87060  181.343964  15.947282
2009-02-13  13.118716   8.82224  178.661643  15.806521
...               ...       ...         ...        ...
2012-04-23  75.635032  15.57434  298.502008  28.711953
2012-04-24  74.124187  15.65173  300.335186  28.533175
2012-04-25  80.702069  15.88390  304.555978  28.783467
2012-04-26  80.397780  15.99030  307.428105  28.703016
2012-04-27  79.775980  15.90324  307.183354  28.586808
2012-04-30  77.259659  15.83553  302.123410  28.622565
2012-05-01  77.014910  15.86455  301.913607  28.613624
2012-05-02  77.524255  15.64689  303.327209  28.425907
2012-05-03  76.973895  15.70010  305.205309  28.390152
2012-05-04  74.781710  15.29381  298.187334  27.692912
2012-05-07  75.341333  15.30348  303.472045  27.397926
2012-05-08  75.169344  15.19708  306.089446  27.263842
2012-05-09  75.301646  15.15838  304.271262  27.496255
2012-05-10  75.478919  15.04230  306.524016  27.478377
2012-05-11  74.974867  14.91654  302.313200  27.853814
2012-05-14  73.851650  14.93589  301.698816  27.424744
2012-05-15  73.183543  14.83916  305.250263  27.181807
2012-05-16  72.245548  14.52477  314.151389  26.902881
2012-05-17  70.134066  14.45222  311.214326  26.740924
2012-05-18  70.168461  14.25875  299.900615  26.336032
2012-05-21  74.256482  14.48124  306.748784  26.767917
2012-05-22  73.686282  14.58765  300.100412  26.776915
2012-05-23  75.484211  12.08221  304.426106  26.192070
2012-05-24  74.790973  12.04351  301.528978  26.156079
2012-05-25  74.390105  12.05319  295.470050  26.147081
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  75.710442  12.24666  296.873645  26.596962
2012-05-30  76.623304  12.14992  293.821674  26.399015
2012-05-31  76.432797  11.92743  290.140354  26.264051
2012-06-01  74.218116  11.67592  285.205295  25.598227

[868 rows x 4 columns]

In [203]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close     Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900   74.218116
DELL   12.150000   12.300000   12.045000   12.070000   19397600   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300   25.598227

In [204]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300

                   Adj Close
Date       minor
2012-05-30 AAPL    76.623304
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.399015
2012-05-31 AAPL    76.432797
           DELL    11.927430
           GOOG   290.140354
           MSFT    26.264051
2012-06-01 AAPL    74.218116
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.598227

In [205]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [206]:
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [207]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [208]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [209]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [210]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [211]:
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14

In [212]:
result = pd.read_table('ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [213]:
!type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [214]:
pd.read_csv('ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [215]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,NA
three,9,10,11,12,foo

In [216]:
result = pd.read_csv('ex5.csv')
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6 NaN   8     NaN
2     three  9  10  11  12     foo

In [217]:
pd.isnull(result)

  something      a      b      c      d message
0     False  False  False  False  False    True
1     False  False  False   True  False    True
2     False  False  False  False  False   False

In [218]:
result = pd.read_csv('ex5.csv', na_values=['Null'])
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6 NaN   8     NaN
2     three  9  10  11  12     foo

In [219]:
sentinels = {'message':['foo','NA'], 'something': ['two']}
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b   c   d  message
0       one  1   2   3   4      NaN
1       NaN  5   6 NaN   8      NaN
2     three  9  10  11  12      NaN

In [220]:
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
5     1.817480  0.742273  0.419395 -2.251035   Q
6    -0.776764  0.935518 -0.332872 -1.875641   U
7    -0.913135  1.530624 -0.572657  0.477252   K
8     0.358480 -0.497572 -0.367016  0.507702   S
9    -1.740877 -1.160417 -1.637830  2.172201   G
10    0.240564 -0.328249  1.252155  1.072796   8
11    0.764018  1.165476 -0.639544  1.495258   R
12    0.571035 -0.310537  0.582437 -0.298765   1
13    2.317658  0.430710 -1.334216  0.199679   P
14    1.547771 -1.119753 -2.277634  0.329586   J
15   -1.310608  0.401719 -1.000987  1.156708   E
16   -0.088496  0.634712  0.153324  0.415335   B
17   -0.018663 -0.247487 -1.446522  0.750938   A
18   -0.070127 -1.579097  0.120892  0.671432   F
19   -0.194678 -0.492039  2.359605  0.319810   H
20   -0.248618  0.868707 -0.492226 -0.717959   W
21   -1.091549 -0.867110 -0.647760 -0.832562   C
22    0.641404 -0.138822 -0.621963 -0.284839   C
23    1.216408  0.992687  0.165162 -0.069619   V
24   -0.564474  0.792832  0.747053  0.571675   I
25    1.759879 -0.515666 -0.230481  1.362317   S
26    0.126266  0.309281  0.382820 -0.239199   L
27    1.334360 -0.100152 -0.840731 -0.643967   6
28   -0.737620  0.278087 -0.053235 -0.950972   J
29   -1.148486 -0.986292 -0.144963  0.124362   Y
...        ...       ...       ...       ...  ..
9970  0.633495 -0.186524  0.927627  0.143164   4
9971  0.308636 -0.112857  0.762842 -1.072977   1
9972 -1.627051 -0.978151  0.154745 -1.229037   Z
9973  0.314847  0.097989  0.199608  0.955193   P
9974  1.666907  0.992005  0.496128 -0.686391   S
9975  0.010603  0.708540 -1.258711  0.226541   K
9976  0.118693 -0.714455 -0.501342 -0.254764   K
9977  0.302616 -2.011527 -0.628085  0.768827   H
9978 -0.098572  1.769086 -0.215027 -0.053076   A
9979 -0.019058  1.964994  0.738538 -0.883776   F
9980 -0.595349  0.001781 -1.423355 -1.458477   M
9981  1.392170 -1.396560 -1.425306 -0.847535   H
9982 -0.896029 -0.152287  1.924483  0.365184   6
9983 -2.274642 -0.901874  1.500352  0.996541   N
9984 -0.301898  1.019906  1.102160  2.624526   I
9985 -2.548389 -0.585374  1.496201 -0.718815   D
9986 -0.064588  0.759292 -1.568415 -0.420933   E
9987 -0.143365 -1.111760 -1.815581  0.435274   2
9988 -0.070412 -1.055921  0.338017 -0.440763   X
9989  0.649148  0.994273 -1.384227  0.485120   Q
9990 -0.370769  0.404356 -1.051628 -1.050899   8
9991 -0.409980  0.155627 -0.818990  1.277350   W
9992  0.301214 -1.111203  0.668258  0.671922   A
9993  1.821117  0.416445  0.173874  0.505118   X
9994  0.068804  1.322759  0.802346  0.223618   H
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [221]:
pd.read_csv('ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [222]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)
tot = Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot[:10]

E    368
X    364
L    346
O    343
Q    340
M    338
J    337
F    335
K    334
H    330
dtype: float64

In [223]:
data = pd.read_csv('ex5.csv')
data

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6 NaN   8     NaN
2     three  9  10  11  12     foo

In [224]:
data.to_csv('out.csv')
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,
2,three,9,10,11.0,12,foo

In [225]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|
2|three|9|10|11.0|12|foo

In [226]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,NULL
2,three,9,10,11.0,12,foo

In [227]:
data.to_csv(sys.stdout,index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,
three,9,10,11.0,12,foo

In [228]:
data.to_csv(sys.stdout, index=False, cols=['a', 'b', 'c'])

something,a,b,c,d,message
one,1,2,3.0,4,
two,5,6,,8,
three,9,10,11.0,12,foo

In [229]:
dates = pd.date_range('1/1/2000', periods=7)
ts = Series(np.arange(7), index=dates)
ts.to_csv('tseries.csv')
!type tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [230]:
Series.from_csv('tseries.csv', parse_dates=True)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
dtype: int64

In [231]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3","4"

In [232]:
import csv
f = open('ex7.csv')
reader = csv.reader(f)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [235]:
lines = list(csv.reader(open('ex7.csv')))
header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [236]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    
reader = csv.reader(f, dialect=my_dialect)
reader = csv.reader(f, delimiter='|')

with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [237]:
obj = """
{
"name" : "Wes",
"places_lived" : ["United States", "Spain","Germany"],
"pet": null,
"siblings" : [{"name":"Scott","age":25, "pet":"Zuko"},
            {"name":"Katie", "age":33,"pet":"Cisco"}]            
}
"""

In [238]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'name': 'Scott', 'pet': 'Zuko'},
  {'age': 33, 'name': 'Katie', 'pet': 'Cisco'}]}

In [239]:
asjson = json.dumps(result)
siblings = DataFrame(result['siblings'], columns=['name','age'])
siblings

    name  age
0  Scott   25
1  Katie   33

In [240]:
from lxml.html import parse
import urllib.request

parsed = parse(urllib.request.urlopen('http://finance.yahoo.com/q/op?s=AAPL+Options'))
doc = parsed.getroot()

links = doc.findall('.//a')
links[15:20]

[<Element a at 0x1889f0fde08>,
 <Element a at 0x1889f0fde58>,
 <Element a at 0x1889f0fdea8>,
 <Element a at 0x1889f0fdef8>,
 <Element a at 0x1889f0fdf48>]

In [241]:
lnk = links[28]
lnk

In [242]:
lnk.get('href')

'https://login.yahoo.com/account/personalinfo?.intl=us&.lang=en-US&.done=http://finance.yahoo.com/q/op%3fs=AAPL%2520Options&.src=quote&.intl=us&.lang=en-US'

In [244]:
lnk.text_content()

'Account Info'

In [245]:
urls = [lnk.get('href') for lnk in doc.findall('.//a')]
urls[-10:]

['/q/op?s=AAPL&strike=117.00',
 '/q?s=AAPL160422P00117000',
 '/q/op?s=AAPL&strike=118.00',
 '/q?s=AAPL160422P00118000',
 '/q/op?s=AAPL&strike=119.00',
 '/q?s=AAPL160422P00119000',
 '/q/op?s=AAPL&strike=120.00',
 '/q?s=AAPL160422P00120000',
 '/q/op?s=AAPL&strike=125.00',
 '/q?s=AAPL160422P00125000']

In [247]:
tables = doc.findall('.//table')
len(tables)

3

In [250]:
calls = tables[0]
puts = tables[2]
rows = calls.findall('.//tr')
def _unpack(row, kind='td'):
    elts = row.findall('.//%s' % kind)
    return [val.text_content() for val in elts]
_unpack(rows[0], kind='th')

[]

In [253]:
_unpack(rows[0], kind='td')

['  ', 'Search FinanceSearch Web']

In [257]:
from pandas.io.parsers import TextParser

#def parse_options_data(table):
#    rows = table.findall('.//tr')
#    header = _unpack(rows[0], kind='th')
#    data = [_unpack(r) for r in rows[1:]]
#    return TextParser(data, names=header).get_chunk()
#call_data = parse_options_data(calls)
#put_data = parse_options_data(puts)
#call_data[:]

In [265]:
from lxml import objectify
path = 'Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

perf = DataFrame(data)
perf

In [268]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'

root = objectify.parse(StringIO(tag)).getroot()
root

In [269]:
root.get('href')

'http://www.google.com'

In [270]:
root.text

'Google'

In [272]:
frame = pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [274]:
frame.to_pickle('frame_pickle')

In [276]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [278]:
store = pd.HDFStore('mydata.h5')

In [279]:
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5
/obj1                frame        (shape->[3,5])
/obj1_col            series       (shape->[3])

In [280]:
store['obj1']

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [282]:
xls_file = pd.ExcelFile('starname.xlsx')

In [283]:
table = xls_file.parse('Sheet1')

In [298]:
import requests
url = 'http://ip.taobao.com/service/getIpInfo.php?ip=203.208.60.240'
resp = requests.get(url)
resp

In [299]:
import json
data = json.loads(resp.text)
data.keys()
data

{'code': 0,
 'data': {'area': '',
  'area_id': '100000',
  'city': '',
  'city_id': '110100',
  'country': '',
  'country_id': 'CN',
  'county': '',
  'county_id': '-1',
  'ip': '203.208.60.240',
  'isp': '',
  'isp_id': '-1',
  'region': '',
  'region_id': '110000'}}

In [305]:
data_fields = ['area','city','ip']
datas = DataFrame(data['data'], columns=data_fields,index=range(len(data)-1))
datas

  area city              ip
0       203.208.60.240

In [308]:
datas.ix[0]

area
city
ip      203.208.60.240
Name: 0, dtype: object

In [309]:
#MongoDB

In [1]:
from mpl_toolkits.mplot3d import Axes3D
from matplotlib import cm
from matplotlib.ticker import LinearLocator
import matplotlib.pyplot as plt
import numpy as np


fig = plt.figure()
ax = fig.gca(projection='3d')
# ax.set_aspect('equal')
# ax.set_axis_off()
[x, t] = np.meshgrid(np.array([range(25)])/24.0, np.arange(0, 575.5, 0.5)/575*17*np.pi-2*np.pi)
p = (np.pi/2)*np.exp(-t/(8*np.pi))
u = 1-(1-np.mod(3.6*t, 2*np.pi)/np.pi)**4/2
y = 2*(x**2-x)**2*np.sin(p)
r = u*(x*np.sin(p)+y*np.cos(p))

surf = ax.plot_surface(r*np.cos(t), r*np.sin(t), u*(x*np.cos(p)-y*np.sin(p)), rstride=1, cstride=1, cmap=cm.gist_rainbow_r,
                        linewidth=0, antialiased=True)
plt.show()